---
kind: property
id: P:Autodesk.Revit.DB.GradientBackgroundSettings.HorizonColor
source: html/a62f3e13-1d55-2b65-adfb-8a35e5d957bb.htm
---
# Autodesk.Revit.DB.GradientBackgroundSettings.HorizonColor Property

The color of the horizon.

## Syntax (C#)
```csharp
public Color HorizonColor { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null